Tekla Open API Reference for Tekla Structures 2025
OBB.Axis1 Property
 Gets an axis parallel to the second side of the OBB, a unit-length vector orthogonal to Axis0 and Axis2.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector Axis1 { get; }
Public ReadOnly Property Axis1 As Vector
	Get
Property Value
Type: Vector
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace